using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace DeckSorter.Functionality
{
    public static class DeckGenerator
    {
        //const string[] STANDARTDECK52 = new string[] {"101","102","103","104","105","106","107","108","109","110","111","112","113","201","202","203","204","205","206","207","208","209","210","211","212","213","301","302","303","304","305","306","307","308","309","310","311","312","313","401","402", "403", "404", "405", "406", "407","408", "409", "410", "411", "412", "413" };
        const string STANDARTDECK52 = "101,102,103,104,105,106,107,108,109,110,111,112,113," +
                                      "201,202,203,204,205,206,207,208,209,210,211,212,213," +
                                      "301,302,303,304,305,306,307,308,309,310,311,312,313," +
                                      "401,402,403,404,405,406,407,408,409,410,411,412,413";
        const string STANDARTDECK36 = "101,106,107,108,109,110,111,112,113," +
                                      "201,206,207,208,209,210,211,212,213," +
                                      "301,306,307,308,309,310,311,312,313," +
                                      "401,406,407,408,409,410,411,412,413";
        //Метод возвращает строку со стандартным порядком карт.
        public static string GetDeckBySize(int size)
        {
            if (size == 36) return STANDARTDECK36;
            else return STANDARTDECK52;
        }
    }
}
